import random

answers = ['Бесспорно', "Предрешено", 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
           'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
           'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос. Как тебя зовут?')
a = input()
print(f'Приветствую тебя, {a}')
while True:
    a = input('Какой вопрос тебя интересует? Задай же его скорее \n')
    print(random.choice(answers))
    print('Еще вопросы будут? Набери Y если хочеш получить больше ответов')
    q = input()
    if q.upper() == 'Y':
        continue
    else:
        print('Возвращайся если возникнут вопросы!')
        break
